# taps
tap 'homebrew/bundle'

# Packages
brew 'awscli'
brew 'coreutils' # Those that come with MacOS are outdated
brew 'ffmpeg' # For audacity
brew 'git'
brew 'jq' # To query files, amazing tool
brew 'mas' # Install App Store apps through CLI
brew 'hugo' # Install Hugo
brew 'stow'
brew 'fzf'
brew 'tmux'
brew 'ripgrep'

# Day to day apps
cask '1password'
cask '1password-cli'
cask 'docker'
cask 'google-chrome'
cask 'firefox'
cask 'slack'
cask 'cleanshot'
cask 'reader'
cask 'superhuman'
cask 'notion'
cask 'spotify'
cask 'caffeine'

# Streaming and Recording
cask 'ecamm-live'
cask 'audacity'
cask 'elgato-control-center'
cask 'elgato-stream-deck'
cask 'logi-options+'
cask 'obs'
cask 'loom'

# Code Editors
cask 'visual-studio-code'
brew 'neovim'


# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-jetbrains-mono'

# Mac App Store
mas 'Final Cut Pro', id: 424389933
mas 'Magnet', id: 441258766
mas 'Whatsapp', id: 1147396723
mas 'Hidden Bar', id: 1452453066
mas 'Affinity Photo 2', id: 1616822987
mas 'Keystroke Pro', id: 1572206224
mas 'Day One', id: 1055511498
mas 'Kindle', id: 302584613
