# taps
tap 'homebrew/bundle'

# Packages
brew 'awscli'
brew 'coreutils' # Those that come with MacOS are outdated
brew 'ffmpeg' # For audacity
brew 'git'
brew 'jq' # To query files, amazing tool
brew 'mas' # Install App Store apps through CLI
brew 'hugo' # Install Hugo
brew 'stow'
brew 'fzf'
brew 'tmux'
brew 'ripgrep'

# Day to day apps
cask '1password'
cask '1password-cli'
cask 'docker'
cask 'google-chrome'
cask 'arc'
cask 'slack'
cask 'cleanshot'
cask 'reader'
cask 'superhuman'
cask 'notion'
cask 'spotify'
cask 'caffeine'

# Streaming and Recording
cask 'ecamm-live'
cask 'audacity'
cask 'elgato-control-center'
cask 'elgato-stream-deck'
cask 'obs'

# Code Editors
cask 'visual-studio-code'
cask 'jetbrains-toolbox'
cask 'webstorm'
brew 'neovim'
cask 'pycharm'
cask 'rustrover'


# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-jetbrains-mono'

# Mac App Store

